using _2DGAMELIB;

namespace SlaveMatrix
{
    public class 足_竜 : 獣足
    {
    	public ShapePart X0Y0_足;

    	public ShapePart X0Y0_竜性_鱗足_鱗6;

    	public ShapePart X0Y0_竜性_鱗足_鱗5;

    	public ShapePart X0Y0_竜性_鱗足_鱗4;

    	public ShapePart X0Y0_竜性_鱗足_鱗3;

    	public ShapePart X0Y0_竜性_鱗足_鱗2;

    	public ShapePart X0Y0_竜性_鱗足_鱗1;

    	public ShapePart X0Y0_竜性_鱗踵_鱗1;

    	public ShapePart X0Y0_竜性_鱗踵_鱗2;

    	public ShapePart X0Y0_竜性_鱗踵_鱗3;

    	public ShapePart X0Y0_竜性_鱗甲_鱗11;

    	public ShapePart X0Y0_竜性_鱗甲_鱗10;

    	public ShapePart X0Y0_竜性_鱗甲_鱗9;

    	public ShapePart X0Y0_竜性_鱗甲_鱗8;

    	public ShapePart X0Y0_竜性_鱗甲_鱗7;

    	public ShapePart X0Y0_竜性_鱗甲_鱗6;

    	public ShapePart X0Y0_竜性_鱗甲_鱗5;

    	public ShapePart X0Y0_竜性_鱗甲_鱗4;

    	public ShapePart X0Y0_竜性_鱗甲_鱗3;

    	public ShapePart X0Y0_竜性_鱗甲_鱗2;

    	public ShapePart X0Y0_竜性_鱗甲_鱗1;

    	public ShapePart X0Y0_薬指_指;

    	public ShapePart X0Y0_薬指_爪;

    	public ShapePart X0Y0_薬指_竜性_鱗_下_鱗1;

    	public ShapePart X0Y0_薬指_竜性_鱗_下_鱗2;

    	public ShapePart X0Y0_薬指_竜性_鱗_上_鱗1;

    	public ShapePart X0Y0_薬指_竜性_鱗_上_鱗2;

    	public ShapePart X0Y0_薬指_竜性_鱗_上_鱗3;

    	public ShapePart X0Y0_中指_指;

    	public ShapePart X0Y0_中指_爪;

    	public ShapePart X0Y0_中指_竜性_鱗_下_鱗1;

    	public ShapePart X0Y0_中指_竜性_鱗_下_鱗2;

    	public ShapePart X0Y0_中指_竜性_鱗_上_鱗1;

    	public ShapePart X0Y0_中指_竜性_鱗_上_鱗2;

    	public ShapePart X0Y0_中指_竜性_鱗_上_鱗3;

    	public ShapePart X0Y0_人指_指;

    	public ShapePart X0Y0_人指_爪;

    	public ShapePart X0Y0_人指_竜性_鱗_下_鱗1;

    	public ShapePart X0Y0_人指_竜性_鱗_下_鱗2;

    	public ShapePart X0Y0_人指_竜性_鱗_上_鱗1;

    	public ShapePart X0Y0_人指_竜性_鱗_上_鱗2;

    	public ShapePart X0Y0_人指_竜性_鱗_上_鱗3;

    	public ShapePart X0Y0_親指_指;

    	public ShapePart X0Y0_親指_爪;

    	public ShapePart X0Y0_親指_竜性_鱗_下_鱗1;

    	public ShapePart X0Y0_親指_竜性_鱗_下_鱗2;

    	public ShapePart X0Y0_親指_竜性_鱗_上_鱗1;

    	public ShapePart X0Y0_親指_竜性_鱗_上_鱗2;

    	public ShapePart X0Y0_親指_竜性_鱗_上_鱗3;

    	public ShapePart X0Y0_筋;

    	public ShapePart X0Y0_脚輪_革;

    	public ShapePart X0Y0_脚輪_金具1;

    	public ShapePart X0Y0_脚輪_金具2;

    	public ShapePart X0Y0_脚輪_金具3;

    	public ShapePart X0Y0_脚輪_金具左;

    	public ShapePart X0Y0_脚輪_金具右;

    	public ColorD 足CD;

    	public ColorD 竜性_鱗足_鱗6CD;

    	public ColorD 竜性_鱗足_鱗5CD;

    	public ColorD 竜性_鱗足_鱗4CD;

    	public ColorD 竜性_鱗足_鱗3CD;

    	public ColorD 竜性_鱗足_鱗2CD;

    	public ColorD 竜性_鱗足_鱗1CD;

    	public ColorD 竜性_鱗踵_鱗1CD;

    	public ColorD 竜性_鱗踵_鱗2CD;

    	public ColorD 竜性_鱗踵_鱗3CD;

    	public ColorD 竜性_鱗甲_鱗11CD;

    	public ColorD 竜性_鱗甲_鱗10CD;

    	public ColorD 竜性_鱗甲_鱗9CD;

    	public ColorD 竜性_鱗甲_鱗8CD;

    	public ColorD 竜性_鱗甲_鱗7CD;

    	public ColorD 竜性_鱗甲_鱗6CD;

    	public ColorD 竜性_鱗甲_鱗5CD;

    	public ColorD 竜性_鱗甲_鱗4CD;

    	public ColorD 竜性_鱗甲_鱗3CD;

    	public ColorD 竜性_鱗甲_鱗2CD;

    	public ColorD 竜性_鱗甲_鱗1CD;

    	public ColorD 薬指_指CD;

    	public ColorD 薬指_爪CD;

    	public ColorD 薬指_竜性_鱗_下_鱗1CD;

    	public ColorD 薬指_竜性_鱗_下_鱗2CD;

    	public ColorD 薬指_竜性_鱗_上_鱗1CD;

    	public ColorD 薬指_竜性_鱗_上_鱗2CD;

    	public ColorD 薬指_竜性_鱗_上_鱗3CD;

    	public ColorD 中指_指CD;

    	public ColorD 中指_爪CD;

    	public ColorD 中指_竜性_鱗_下_鱗1CD;

    	public ColorD 中指_竜性_鱗_下_鱗2CD;

    	public ColorD 中指_竜性_鱗_上_鱗1CD;

    	public ColorD 中指_竜性_鱗_上_鱗2CD;

    	public ColorD 中指_竜性_鱗_上_鱗3CD;

    	public ColorD 人指_指CD;

    	public ColorD 人指_爪CD;

    	public ColorD 人指_竜性_鱗_下_鱗1CD;

    	public ColorD 人指_竜性_鱗_下_鱗2CD;

    	public ColorD 人指_竜性_鱗_上_鱗1CD;

    	public ColorD 人指_竜性_鱗_上_鱗2CD;

    	public ColorD 人指_竜性_鱗_上_鱗3CD;

    	public ColorD 親指_指CD;

    	public ColorD 親指_爪CD;

    	public ColorD 親指_竜性_鱗_下_鱗1CD;

    	public ColorD 親指_竜性_鱗_下_鱗2CD;

    	public ColorD 親指_竜性_鱗_上_鱗1CD;

    	public ColorD 親指_竜性_鱗_上_鱗2CD;

    	public ColorD 親指_竜性_鱗_上_鱗3CD;

    	public ColorD 筋CD;

    	public ColorD 脚輪_革CD;

    	public ColorD 脚輪_金具1CD;

    	public ColorD 脚輪_金具2CD;

    	public ColorD 脚輪_金具3CD;

    	public ColorD 脚輪_金具左CD;

    	public ColorD 脚輪_金具右CD;

    	public ColorP X0Y0_足CP;

    	public ColorP X0Y0_竜性_鱗足_鱗6CP;

    	public ColorP X0Y0_竜性_鱗足_鱗5CP;

    	public ColorP X0Y0_竜性_鱗足_鱗4CP;

    	public ColorP X0Y0_竜性_鱗足_鱗3CP;

    	public ColorP X0Y0_竜性_鱗足_鱗2CP;

    	public ColorP X0Y0_竜性_鱗足_鱗1CP;

    	public ColorP X0Y0_竜性_鱗踵_鱗1CP;

    	public ColorP X0Y0_竜性_鱗踵_鱗2CP;

    	public ColorP X0Y0_竜性_鱗踵_鱗3CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗11CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗10CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗9CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗8CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗7CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗6CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗5CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗4CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗3CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗2CP;

    	public ColorP X0Y0_竜性_鱗甲_鱗1CP;

    	public ColorP X0Y0_薬指_指CP;

    	public ColorP X0Y0_薬指_爪CP;

    	public ColorP X0Y0_薬指_竜性_鱗_下_鱗1CP;

    	public ColorP X0Y0_薬指_竜性_鱗_下_鱗2CP;

    	public ColorP X0Y0_薬指_竜性_鱗_上_鱗1CP;

    	public ColorP X0Y0_薬指_竜性_鱗_上_鱗2CP;

    	public ColorP X0Y0_薬指_竜性_鱗_上_鱗3CP;

    	public ColorP X0Y0_中指_指CP;

    	public ColorP X0Y0_中指_爪CP;

    	public ColorP X0Y0_中指_竜性_鱗_下_鱗1CP;

    	public ColorP X0Y0_中指_竜性_鱗_下_鱗2CP;

    	public ColorP X0Y0_中指_竜性_鱗_上_鱗1CP;

    	public ColorP X0Y0_中指_竜性_鱗_上_鱗2CP;

    	public ColorP X0Y0_中指_竜性_鱗_上_鱗3CP;

    	public ColorP X0Y0_人指_指CP;

    	public ColorP X0Y0_人指_爪CP;

    	public ColorP X0Y0_人指_竜性_鱗_下_鱗1CP;

    	public ColorP X0Y0_人指_竜性_鱗_下_鱗2CP;

    	public ColorP X0Y0_人指_竜性_鱗_上_鱗1CP;

    	public ColorP X0Y0_人指_竜性_鱗_上_鱗2CP;

    	public ColorP X0Y0_人指_竜性_鱗_上_鱗3CP;

    	public ColorP X0Y0_親指_指CP;

    	public ColorP X0Y0_親指_爪CP;

    	public ColorP X0Y0_親指_竜性_鱗_下_鱗1CP;

    	public ColorP X0Y0_親指_竜性_鱗_下_鱗2CP;

    	public ColorP X0Y0_親指_竜性_鱗_上_鱗1CP;

    	public ColorP X0Y0_親指_竜性_鱗_上_鱗2CP;

    	public ColorP X0Y0_親指_竜性_鱗_上_鱗3CP;

    	public ColorP X0Y0_筋CP;

    	public ColorP X0Y0_脚輪_革CP;

    	public ColorP X0Y0_脚輪_金具1CP;

    	public ColorP X0Y0_脚輪_金具2CP;

    	public ColorP X0Y0_脚輪_金具3CP;

    	public ColorP X0Y0_脚輪_金具左CP;

    	public ColorP X0Y0_脚輪_金具右CP;

    	public 拘束鎖 鎖1;

    	public override bool 欠損
    	{
    		get
    		{
    			return 欠損_;
    		}
    		set
    		{
    			欠損_ = value;
    		}
    	}

    	public override bool 筋肉
    	{
    		get
    		{
    			return 筋肉_;
    		}
    		set
    		{
    			筋肉_ = value;
    			筋_表示 = 筋肉_;
    		}
    	}

    	public override bool 拘束
    	{
    		get
    		{
    			return 拘束_;
    		}
    		set
    		{
    			拘束_ = value;
    			脚輪表示 = 拘束_;
    		}
    	}

    	public bool 足_表示
    	{
    		get
    		{
    			return X0Y0_足.Dra;
    		}
    		set
    		{
    			X0Y0_足.Dra = value;
    			X0Y0_足.Hit = value;
    		}
    	}

    	public bool 竜性_鱗足_鱗6_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗足_鱗6.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗足_鱗6.Dra = value;
    			X0Y0_竜性_鱗足_鱗6.Hit = value;
    		}
    	}

    	public bool 竜性_鱗足_鱗5_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗足_鱗5.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗足_鱗5.Dra = value;
    			X0Y0_竜性_鱗足_鱗5.Hit = value;
    		}
    	}

    	public bool 竜性_鱗足_鱗4_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗足_鱗4.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗足_鱗4.Dra = value;
    			X0Y0_竜性_鱗足_鱗4.Hit = value;
    		}
    	}

    	public bool 竜性_鱗足_鱗3_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗足_鱗3.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗足_鱗3.Dra = value;
    			X0Y0_竜性_鱗足_鱗3.Hit = value;
    		}
    	}

    	public bool 竜性_鱗足_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗足_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗足_鱗2.Dra = value;
    			X0Y0_竜性_鱗足_鱗2.Hit = value;
    		}
    	}

    	public bool 竜性_鱗足_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗足_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗足_鱗1.Dra = value;
    			X0Y0_竜性_鱗足_鱗1.Hit = value;
    		}
    	}

    	public bool 竜性_鱗踵_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗踵_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗踵_鱗1.Dra = value;
    			X0Y0_竜性_鱗踵_鱗1.Hit = value;
    		}
    	}

    	public bool 竜性_鱗踵_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗踵_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗踵_鱗2.Dra = value;
    			X0Y0_竜性_鱗踵_鱗2.Hit = value;
    		}
    	}

    	public bool 竜性_鱗踵_鱗3_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗踵_鱗3.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗踵_鱗3.Dra = value;
    			X0Y0_竜性_鱗踵_鱗3.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗11_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗11.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗11.Dra = value;
    			X0Y0_竜性_鱗甲_鱗11.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗10_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗10.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗10.Dra = value;
    			X0Y0_竜性_鱗甲_鱗10.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗9_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗9.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗9.Dra = value;
    			X0Y0_竜性_鱗甲_鱗9.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗8_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗8.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗8.Dra = value;
    			X0Y0_竜性_鱗甲_鱗8.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗7_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗7.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗7.Dra = value;
    			X0Y0_竜性_鱗甲_鱗7.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗6_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗6.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗6.Dra = value;
    			X0Y0_竜性_鱗甲_鱗6.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗5_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗5.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗5.Dra = value;
    			X0Y0_竜性_鱗甲_鱗5.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗4_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗4.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗4.Dra = value;
    			X0Y0_竜性_鱗甲_鱗4.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗3_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗3.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗3.Dra = value;
    			X0Y0_竜性_鱗甲_鱗3.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗2.Dra = value;
    			X0Y0_竜性_鱗甲_鱗2.Hit = value;
    		}
    	}

    	public bool 竜性_鱗甲_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_竜性_鱗甲_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_竜性_鱗甲_鱗1.Dra = value;
    			X0Y0_竜性_鱗甲_鱗1.Hit = value;
    		}
    	}

    	public bool 薬指_指_表示
    	{
    		get
    		{
    			return X0Y0_薬指_指.Dra;
    		}
    		set
    		{
    			X0Y0_薬指_指.Dra = value;
    			X0Y0_薬指_指.Hit = value;
    		}
    	}

    	public bool 薬指_爪_表示
    	{
    		get
    		{
    			return X0Y0_薬指_爪.Dra;
    		}
    		set
    		{
    			X0Y0_薬指_爪.Dra = value;
    			X0Y0_薬指_爪.Hit = value;
    		}
    	}

    	public bool 薬指_竜性_鱗_下_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_薬指_竜性_鱗_下_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_薬指_竜性_鱗_下_鱗1.Dra = value;
    			X0Y0_薬指_竜性_鱗_下_鱗1.Hit = value;
    		}
    	}

    	public bool 薬指_竜性_鱗_下_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_薬指_竜性_鱗_下_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_薬指_竜性_鱗_下_鱗2.Dra = value;
    			X0Y0_薬指_竜性_鱗_下_鱗2.Hit = value;
    		}
    	}

    	public bool 薬指_竜性_鱗_上_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_薬指_竜性_鱗_上_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_薬指_竜性_鱗_上_鱗1.Dra = value;
    			X0Y0_薬指_竜性_鱗_上_鱗1.Hit = value;
    		}
    	}

    	public bool 薬指_竜性_鱗_上_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_薬指_竜性_鱗_上_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_薬指_竜性_鱗_上_鱗2.Dra = value;
    			X0Y0_薬指_竜性_鱗_上_鱗2.Hit = value;
    		}
    	}

    	public bool 薬指_竜性_鱗_上_鱗3_表示
    	{
    		get
    		{
    			return X0Y0_薬指_竜性_鱗_上_鱗3.Dra;
    		}
    		set
    		{
    			X0Y0_薬指_竜性_鱗_上_鱗3.Dra = value;
    			X0Y0_薬指_竜性_鱗_上_鱗3.Hit = value;
    		}
    	}

    	public bool 中指_指_表示
    	{
    		get
    		{
    			return X0Y0_中指_指.Dra;
    		}
    		set
    		{
    			X0Y0_中指_指.Dra = value;
    			X0Y0_中指_指.Hit = value;
    		}
    	}

    	public bool 中指_爪_表示
    	{
    		get
    		{
    			return X0Y0_中指_爪.Dra;
    		}
    		set
    		{
    			X0Y0_中指_爪.Dra = value;
    			X0Y0_中指_爪.Hit = value;
    		}
    	}

    	public bool 中指_竜性_鱗_下_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_中指_竜性_鱗_下_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_中指_竜性_鱗_下_鱗1.Dra = value;
    			X0Y0_中指_竜性_鱗_下_鱗1.Hit = value;
    		}
    	}

    	public bool 中指_竜性_鱗_下_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_中指_竜性_鱗_下_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_中指_竜性_鱗_下_鱗2.Dra = value;
    			X0Y0_中指_竜性_鱗_下_鱗2.Hit = value;
    		}
    	}

    	public bool 中指_竜性_鱗_上_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_中指_竜性_鱗_上_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_中指_竜性_鱗_上_鱗1.Dra = value;
    			X0Y0_中指_竜性_鱗_上_鱗1.Hit = value;
    		}
    	}

    	public bool 中指_竜性_鱗_上_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_中指_竜性_鱗_上_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_中指_竜性_鱗_上_鱗2.Dra = value;
    			X0Y0_中指_竜性_鱗_上_鱗2.Hit = value;
    		}
    	}

    	public bool 中指_竜性_鱗_上_鱗3_表示
    	{
    		get
    		{
    			return X0Y0_中指_竜性_鱗_上_鱗3.Dra;
    		}
    		set
    		{
    			X0Y0_中指_竜性_鱗_上_鱗3.Dra = value;
    			X0Y0_中指_竜性_鱗_上_鱗3.Hit = value;
    		}
    	}

    	public bool 人指_指_表示
    	{
    		get
    		{
    			return X0Y0_人指_指.Dra;
    		}
    		set
    		{
    			X0Y0_人指_指.Dra = value;
    			X0Y0_人指_指.Hit = value;
    		}
    	}

    	public bool 人指_爪_表示
    	{
    		get
    		{
    			return X0Y0_人指_爪.Dra;
    		}
    		set
    		{
    			X0Y0_人指_爪.Dra = value;
    			X0Y0_人指_爪.Hit = value;
    		}
    	}

    	public bool 人指_竜性_鱗_下_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_人指_竜性_鱗_下_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_人指_竜性_鱗_下_鱗1.Dra = value;
    			X0Y0_人指_竜性_鱗_下_鱗1.Hit = value;
    		}
    	}

    	public bool 人指_竜性_鱗_下_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_人指_竜性_鱗_下_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_人指_竜性_鱗_下_鱗2.Dra = value;
    			X0Y0_人指_竜性_鱗_下_鱗2.Hit = value;
    		}
    	}

    	public bool 人指_竜性_鱗_上_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_人指_竜性_鱗_上_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_人指_竜性_鱗_上_鱗1.Dra = value;
    			X0Y0_人指_竜性_鱗_上_鱗1.Hit = value;
    		}
    	}

    	public bool 人指_竜性_鱗_上_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_人指_竜性_鱗_上_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_人指_竜性_鱗_上_鱗2.Dra = value;
    			X0Y0_人指_竜性_鱗_上_鱗2.Hit = value;
    		}
    	}

    	public bool 人指_竜性_鱗_上_鱗3_表示
    	{
    		get
    		{
    			return X0Y0_人指_竜性_鱗_上_鱗3.Dra;
    		}
    		set
    		{
    			X0Y0_人指_竜性_鱗_上_鱗3.Dra = value;
    			X0Y0_人指_竜性_鱗_上_鱗3.Hit = value;
    		}
    	}

    	public bool 親指_指_表示
    	{
    		get
    		{
    			return X0Y0_親指_指.Dra;
    		}
    		set
    		{
    			X0Y0_親指_指.Dra = value;
    			X0Y0_親指_指.Hit = value;
    		}
    	}

    	public bool 親指_爪_表示
    	{
    		get
    		{
    			return X0Y0_親指_爪.Dra;
    		}
    		set
    		{
    			X0Y0_親指_爪.Dra = value;
    			X0Y0_親指_爪.Hit = value;
    		}
    	}

    	public bool 親指_竜性_鱗_下_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_親指_竜性_鱗_下_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_親指_竜性_鱗_下_鱗1.Dra = value;
    			X0Y0_親指_竜性_鱗_下_鱗1.Hit = value;
    		}
    	}

    	public bool 親指_竜性_鱗_下_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_親指_竜性_鱗_下_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_親指_竜性_鱗_下_鱗2.Dra = value;
    			X0Y0_親指_竜性_鱗_下_鱗2.Hit = value;
    		}
    	}

    	public bool 親指_竜性_鱗_上_鱗1_表示
    	{
    		get
    		{
    			return X0Y0_親指_竜性_鱗_上_鱗1.Dra;
    		}
    		set
    		{
    			X0Y0_親指_竜性_鱗_上_鱗1.Dra = value;
    			X0Y0_親指_竜性_鱗_上_鱗1.Hit = value;
    		}
    	}

    	public bool 親指_竜性_鱗_上_鱗2_表示
    	{
    		get
    		{
    			return X0Y0_親指_竜性_鱗_上_鱗2.Dra;
    		}
    		set
    		{
    			X0Y0_親指_竜性_鱗_上_鱗2.Dra = value;
    			X0Y0_親指_竜性_鱗_上_鱗2.Hit = value;
    		}
    	}

    	public bool 親指_竜性_鱗_上_鱗3_表示
    	{
    		get
    		{
    			return X0Y0_親指_竜性_鱗_上_鱗3.Dra;
    		}
    		set
    		{
    			X0Y0_親指_竜性_鱗_上_鱗3.Dra = value;
    			X0Y0_親指_竜性_鱗_上_鱗3.Hit = value;
    		}
    	}

    	public bool 筋_表示
    	{
    		get
    		{
    			return X0Y0_筋.Dra;
    		}
    		set
    		{
    			X0Y0_筋.Dra = value;
    			X0Y0_筋.Hit = value;
    		}
    	}

    	public bool 脚輪_革_表示
    	{
    		get
    		{
    			return X0Y0_脚輪_革.Dra;
    		}
    		set
    		{
    			X0Y0_脚輪_革.Dra = value;
    			X0Y0_脚輪_革.Hit = value;
    		}
    	}

    	public bool 脚輪_金具1_表示
    	{
    		get
    		{
    			return X0Y0_脚輪_金具1.Dra;
    		}
    		set
    		{
    			X0Y0_脚輪_金具1.Dra = value;
    			X0Y0_脚輪_金具1.Hit = value;
    		}
    	}

    	public bool 脚輪_金具2_表示
    	{
    		get
    		{
    			return X0Y0_脚輪_金具2.Dra;
    		}
    		set
    		{
    			X0Y0_脚輪_金具2.Dra = value;
    			X0Y0_脚輪_金具2.Hit = value;
    		}
    	}

    	public bool 脚輪_金具3_表示
    	{
    		get
    		{
    			return X0Y0_脚輪_金具3.Dra;
    		}
    		set
    		{
    			X0Y0_脚輪_金具3.Dra = value;
    			X0Y0_脚輪_金具3.Hit = value;
    		}
    	}

    	public bool 脚輪_金具左_表示
    	{
    		get
    		{
    			return X0Y0_脚輪_金具左.Dra;
    		}
    		set
    		{
    			X0Y0_脚輪_金具左.Dra = value;
    			X0Y0_脚輪_金具左.Hit = value;
    		}
    	}

    	public bool 脚輪_金具右_表示
    	{
    		get
    		{
    			return X0Y0_脚輪_金具右.Dra;
    		}
    		set
    		{
    			X0Y0_脚輪_金具右.Dra = value;
    			X0Y0_脚輪_金具右.Hit = value;
    		}
    	}

    	public bool 脚輪表示
    	{
    		get
    		{
    			return 脚輪_革_表示;
    		}
    		set
    		{
    			脚輪_革_表示 = value;
    			脚輪_金具1_表示 = value;
    			脚輪_金具2_表示 = value;
    			脚輪_金具3_表示 = value;
    			脚輪_金具左_表示 = value;
    			脚輪_金具右_表示 = value;
    		}
    	}

    	public bool 鎖表示
    	{
    		get
    		{
    			return 鎖1.表示;
    		}
    		set
    		{
    			鎖1.表示 = value;
    		}
    	}

    	public override bool 表示
    	{
    		get
    		{
    			return 足_表示;
    		}
    		set
    		{
    			足_表示 = value;
    			竜性_鱗足_鱗6_表示 = value;
    			竜性_鱗足_鱗5_表示 = value;
    			竜性_鱗足_鱗4_表示 = value;
    			竜性_鱗足_鱗3_表示 = value;
    			竜性_鱗足_鱗2_表示 = value;
    			竜性_鱗足_鱗1_表示 = value;
    			竜性_鱗踵_鱗1_表示 = value;
    			竜性_鱗踵_鱗2_表示 = value;
    			竜性_鱗踵_鱗3_表示 = value;
    			竜性_鱗甲_鱗11_表示 = value;
    			竜性_鱗甲_鱗10_表示 = value;
    			竜性_鱗甲_鱗9_表示 = value;
    			竜性_鱗甲_鱗8_表示 = value;
    			竜性_鱗甲_鱗7_表示 = value;
    			竜性_鱗甲_鱗6_表示 = value;
    			竜性_鱗甲_鱗5_表示 = value;
    			竜性_鱗甲_鱗4_表示 = value;
    			竜性_鱗甲_鱗3_表示 = value;
    			竜性_鱗甲_鱗2_表示 = value;
    			竜性_鱗甲_鱗1_表示 = value;
    			薬指_指_表示 = value;
    			薬指_爪_表示 = value;
    			薬指_竜性_鱗_下_鱗1_表示 = value;
    			薬指_竜性_鱗_下_鱗2_表示 = value;
    			薬指_竜性_鱗_上_鱗1_表示 = value;
    			薬指_竜性_鱗_上_鱗2_表示 = value;
    			薬指_竜性_鱗_上_鱗3_表示 = value;
    			中指_指_表示 = value;
    			中指_爪_表示 = value;
    			中指_竜性_鱗_下_鱗1_表示 = value;
    			中指_竜性_鱗_下_鱗2_表示 = value;
    			中指_竜性_鱗_上_鱗1_表示 = value;
    			中指_竜性_鱗_上_鱗2_表示 = value;
    			中指_竜性_鱗_上_鱗3_表示 = value;
    			人指_指_表示 = value;
    			人指_爪_表示 = value;
    			人指_竜性_鱗_下_鱗1_表示 = value;
    			人指_竜性_鱗_下_鱗2_表示 = value;
    			人指_竜性_鱗_上_鱗1_表示 = value;
    			人指_竜性_鱗_上_鱗2_表示 = value;
    			人指_竜性_鱗_上_鱗3_表示 = value;
    			親指_指_表示 = value;
    			親指_爪_表示 = value;
    			親指_竜性_鱗_下_鱗1_表示 = value;
    			親指_竜性_鱗_下_鱗2_表示 = value;
    			親指_竜性_鱗_上_鱗1_表示 = value;
    			親指_竜性_鱗_上_鱗2_表示 = value;
    			親指_竜性_鱗_上_鱗3_表示 = value;
    			筋_表示 = value;
    			脚輪_革_表示 = value;
    			脚輪_金具1_表示 = value;
    			脚輪_金具2_表示 = value;
    			脚輪_金具3_表示 = value;
    			脚輪_金具左_表示 = value;
    			脚輪_金具右_表示 = value;
    			鎖1.表示 = value;
    		}
    	}

    	public override double Intensity
    	{
    		get
    		{
    			return 足CD.不透明度;
    		}
    		set
    		{
    			足CD.不透明度 = value;
    			竜性_鱗足_鱗6CD.不透明度 = value;
    			竜性_鱗足_鱗5CD.不透明度 = value;
    			竜性_鱗足_鱗4CD.不透明度 = value;
    			竜性_鱗足_鱗3CD.不透明度 = value;
    			竜性_鱗足_鱗2CD.不透明度 = value;
    			竜性_鱗足_鱗1CD.不透明度 = value;
    			竜性_鱗踵_鱗1CD.不透明度 = value;
    			竜性_鱗踵_鱗2CD.不透明度 = value;
    			竜性_鱗踵_鱗3CD.不透明度 = value;
    			竜性_鱗甲_鱗11CD.不透明度 = value;
    			竜性_鱗甲_鱗10CD.不透明度 = value;
    			竜性_鱗甲_鱗9CD.不透明度 = value;
    			竜性_鱗甲_鱗8CD.不透明度 = value;
    			竜性_鱗甲_鱗7CD.不透明度 = value;
    			竜性_鱗甲_鱗6CD.不透明度 = value;
    			竜性_鱗甲_鱗5CD.不透明度 = value;
    			竜性_鱗甲_鱗4CD.不透明度 = value;
    			竜性_鱗甲_鱗3CD.不透明度 = value;
    			竜性_鱗甲_鱗2CD.不透明度 = value;
    			竜性_鱗甲_鱗1CD.不透明度 = value;
    			薬指_指CD.不透明度 = value;
    			薬指_爪CD.不透明度 = value;
    			薬指_竜性_鱗_下_鱗1CD.不透明度 = value;
    			薬指_竜性_鱗_下_鱗2CD.不透明度 = value;
    			薬指_竜性_鱗_上_鱗1CD.不透明度 = value;
    			薬指_竜性_鱗_上_鱗2CD.不透明度 = value;
    			薬指_竜性_鱗_上_鱗3CD.不透明度 = value;
    			中指_指CD.不透明度 = value;
    			中指_爪CD.不透明度 = value;
    			中指_竜性_鱗_下_鱗1CD.不透明度 = value;
    			中指_竜性_鱗_下_鱗2CD.不透明度 = value;
    			中指_竜性_鱗_上_鱗1CD.不透明度 = value;
    			中指_竜性_鱗_上_鱗2CD.不透明度 = value;
    			中指_竜性_鱗_上_鱗3CD.不透明度 = value;
    			人指_指CD.不透明度 = value;
    			人指_爪CD.不透明度 = value;
    			人指_竜性_鱗_下_鱗1CD.不透明度 = value;
    			人指_竜性_鱗_下_鱗2CD.不透明度 = value;
    			人指_竜性_鱗_上_鱗1CD.不透明度 = value;
    			人指_竜性_鱗_上_鱗2CD.不透明度 = value;
    			人指_竜性_鱗_上_鱗3CD.不透明度 = value;
    			親指_指CD.不透明度 = value;
    			親指_爪CD.不透明度 = value;
    			親指_竜性_鱗_下_鱗1CD.不透明度 = value;
    			親指_竜性_鱗_下_鱗2CD.不透明度 = value;
    			親指_竜性_鱗_上_鱗1CD.不透明度 = value;
    			親指_竜性_鱗_上_鱗2CD.不透明度 = value;
    			親指_竜性_鱗_上_鱗3CD.不透明度 = value;
    			筋CD.不透明度 = value;
    			脚輪_革CD.不透明度 = value;
    			脚輪_金具1CD.不透明度 = value;
    			脚輪_金具2CD.不透明度 = value;
    			脚輪_金具3CD.不透明度 = value;
    			脚輪_金具左CD.不透明度 = value;
    			脚輪_金具右CD.不透明度 = value;
    		}
    	}

    	public JointS 鎖1_接続点 => new JointS(Body, X0Y0_脚輪_金具左, 0);

    	public JointS 鎖2_接続点 => new JointS(Body, X0Y0_脚輪_金具右, 0);

    	public 足_竜(double DisUnit, 配色指定 配色指定, BodyColorSet 体配色, ModeEventDispatcher Med, 足_竜D e)
    	{
    		ThisType = GetType();
    		MorphVariant morphVariant = new MorphVariant();
    		morphVariant.Tag = "竜";
    		morphVariant.Add(new PartGroup(Sta.脚左["四足足"][3][0]));
    		Body = new Difs();
    		Body.Tag = morphVariant.Tag;
    		Body.Add(morphVariant);
    		PartGroup partGroup = Body[0][0];
    		X0Y0_足 = partGroup["足"].ToPar();
    		PartGroup pars2 = partGroup["鱗足"].ToPars();
    		X0Y0_竜性_鱗足_鱗6 = pars2["鱗6"].ToPar();
    		X0Y0_竜性_鱗足_鱗5 = pars2["鱗5"].ToPar();
    		X0Y0_竜性_鱗足_鱗4 = pars2["鱗4"].ToPar();
    		X0Y0_竜性_鱗足_鱗3 = pars2["鱗3"].ToPar();
    		X0Y0_竜性_鱗足_鱗2 = pars2["鱗2"].ToPar();
    		X0Y0_竜性_鱗足_鱗1 = pars2["鱗1"].ToPar();
    		pars2 = partGroup["鱗踵"].ToPars();
    		X0Y0_竜性_鱗踵_鱗1 = pars2["鱗1"].ToPar();
    		X0Y0_竜性_鱗踵_鱗2 = pars2["鱗2"].ToPar();
    		X0Y0_竜性_鱗踵_鱗3 = pars2["鱗3"].ToPar();
    		pars2 = partGroup["鱗甲"].ToPars();
    		X0Y0_竜性_鱗甲_鱗11 = pars2["鱗11"].ToPar();
    		X0Y0_竜性_鱗甲_鱗10 = pars2["鱗10"].ToPar();
    		X0Y0_竜性_鱗甲_鱗9 = pars2["鱗9"].ToPar();
    		X0Y0_竜性_鱗甲_鱗8 = pars2["鱗8"].ToPar();
    		X0Y0_竜性_鱗甲_鱗7 = pars2["鱗7"].ToPar();
    		X0Y0_竜性_鱗甲_鱗6 = pars2["鱗6"].ToPar();
    		X0Y0_竜性_鱗甲_鱗5 = pars2["鱗5"].ToPar();
    		X0Y0_竜性_鱗甲_鱗4 = pars2["鱗4"].ToPar();
    		X0Y0_竜性_鱗甲_鱗3 = pars2["鱗3"].ToPar();
    		X0Y0_竜性_鱗甲_鱗2 = pars2["鱗2"].ToPar();
    		X0Y0_竜性_鱗甲_鱗1 = pars2["鱗1"].ToPar();
    		pars2 = partGroup["薬指"].ToPars();
    		X0Y0_薬指_指 = pars2["指"].ToPar();
    		X0Y0_薬指_爪 = pars2["爪"].ToPar();
    		PartGroup pars3 = pars2["鱗"].ToPars();
    		PartGroup pars4 = pars3["下"].ToPars();
    		X0Y0_薬指_竜性_鱗_下_鱗1 = pars4["鱗1"].ToPar();
    		X0Y0_薬指_竜性_鱗_下_鱗2 = pars4["鱗2"].ToPar();
    		pars4 = pars3["上"].ToPars();
    		X0Y0_薬指_竜性_鱗_上_鱗1 = pars4["鱗1"].ToPar();
    		X0Y0_薬指_竜性_鱗_上_鱗2 = pars4["鱗2"].ToPar();
    		X0Y0_薬指_竜性_鱗_上_鱗3 = pars4["鱗3"].ToPar();
    		pars2 = partGroup["中指"].ToPars();
    		X0Y0_中指_指 = pars2["指"].ToPar();
    		X0Y0_中指_爪 = pars2["爪"].ToPar();
    		PartGroup pars5 = pars2["鱗"].ToPars();
    		pars4 = pars5["下"].ToPars();
    		X0Y0_中指_竜性_鱗_下_鱗1 = pars4["鱗1"].ToPar();
    		X0Y0_中指_竜性_鱗_下_鱗2 = pars4["鱗2"].ToPar();
    		pars4 = pars5["上"].ToPars();
    		X0Y0_中指_竜性_鱗_上_鱗1 = pars4["鱗1"].ToPar();
    		X0Y0_中指_竜性_鱗_上_鱗2 = pars4["鱗2"].ToPar();
    		X0Y0_中指_竜性_鱗_上_鱗3 = pars4["鱗3"].ToPar();
    		pars2 = partGroup["人指"].ToPars();
    		X0Y0_人指_指 = pars2["指"].ToPar();
    		X0Y0_人指_爪 = pars2["爪"].ToPar();
    		PartGroup pars6 = pars2["鱗"].ToPars();
    		pars4 = pars6["下"].ToPars();
    		X0Y0_人指_竜性_鱗_下_鱗1 = pars4["鱗1"].ToPar();
    		X0Y0_人指_竜性_鱗_下_鱗2 = pars4["鱗2"].ToPar();
    		pars4 = pars6["上"].ToPars();
    		X0Y0_人指_竜性_鱗_上_鱗1 = pars4["鱗1"].ToPar();
    		X0Y0_人指_竜性_鱗_上_鱗2 = pars4["鱗2"].ToPar();
    		X0Y0_人指_竜性_鱗_上_鱗3 = pars4["鱗3"].ToPar();
    		pars2 = partGroup["親指"].ToPars();
    		X0Y0_親指_指 = pars2["指"].ToPar();
    		X0Y0_親指_爪 = pars2["爪"].ToPar();
    		PartGroup pars7 = pars2["鱗"].ToPars();
    		pars4 = pars7["下"].ToPars();
    		X0Y0_親指_竜性_鱗_下_鱗1 = pars4["鱗1"].ToPar();
    		X0Y0_親指_竜性_鱗_下_鱗2 = pars4["鱗2"].ToPar();
    		pars4 = pars7["上"].ToPars();
    		X0Y0_親指_竜性_鱗_上_鱗1 = pars4["鱗1"].ToPar();
    		X0Y0_親指_竜性_鱗_上_鱗2 = pars4["鱗2"].ToPar();
    		X0Y0_親指_竜性_鱗_上_鱗3 = pars4["鱗3"].ToPar();
    		X0Y0_筋 = partGroup["筋"].ToPar();
    		pars2 = partGroup["脚輪"].ToPars();
    		X0Y0_脚輪_革 = pars2["革"].ToPar();
    		X0Y0_脚輪_金具1 = pars2["金具1"].ToPar();
    		X0Y0_脚輪_金具2 = pars2["金具2"].ToPar();
    		X0Y0_脚輪_金具3 = pars2["金具3"].ToPar();
    		X0Y0_脚輪_金具左 = pars2["金具左"].ToPar();
    		X0Y0_脚輪_金具右 = pars2["金具右"].ToPar();
    		Body.SetJoints();
    		接続根 = new JointD(Body);
    		右 = e.右;
    		反転X = e.反転X;
    		反転Y = e.反転Y;
    		基準C = e.基準C;
    		位置C = e.位置C;
    		角度B = e.角度B;
    		角度C = e.角度C;
    		尺度B = e.尺度B;
    		尺度C = e.尺度C;
    		尺度XB = e.尺度XB;
    		尺度XC = e.尺度XC;
    		尺度YB = e.尺度YB;
    		尺度YC = e.尺度YC;
    		肥大 = e.肥大;
    		身長 = e.身長;
    		Xv = e.Xv;
    		Yv = e.Yv;
    		Xi = e.Xi;
    		Yi = e.Yi;
    		サイズ = e.サイズ;
    		サイズX = e.サイズX;
    		サイズY = e.サイズY;
    		足_表示 = e.足_表示;
    		竜性_鱗足_鱗6_表示 = e.竜性_鱗足_鱗6_表示;
    		竜性_鱗足_鱗5_表示 = e.竜性_鱗足_鱗5_表示;
    		竜性_鱗足_鱗4_表示 = e.竜性_鱗足_鱗4_表示;
    		竜性_鱗足_鱗3_表示 = e.竜性_鱗足_鱗3_表示;
    		竜性_鱗足_鱗2_表示 = e.竜性_鱗足_鱗2_表示;
    		竜性_鱗足_鱗1_表示 = e.竜性_鱗足_鱗1_表示;
    		竜性_鱗踵_鱗1_表示 = e.竜性_鱗踵_鱗1_表示;
    		竜性_鱗踵_鱗2_表示 = e.竜性_鱗踵_鱗2_表示;
    		竜性_鱗踵_鱗3_表示 = e.竜性_鱗踵_鱗3_表示;
    		竜性_鱗甲_鱗11_表示 = e.竜性_鱗甲_鱗11_表示;
    		竜性_鱗甲_鱗10_表示 = e.竜性_鱗甲_鱗10_表示;
    		竜性_鱗甲_鱗9_表示 = e.竜性_鱗甲_鱗9_表示;
    		竜性_鱗甲_鱗8_表示 = e.竜性_鱗甲_鱗8_表示;
    		竜性_鱗甲_鱗7_表示 = e.竜性_鱗甲_鱗7_表示;
    		竜性_鱗甲_鱗6_表示 = e.竜性_鱗甲_鱗6_表示;
    		竜性_鱗甲_鱗5_表示 = e.竜性_鱗甲_鱗5_表示;
    		竜性_鱗甲_鱗4_表示 = e.竜性_鱗甲_鱗4_表示;
    		竜性_鱗甲_鱗3_表示 = e.竜性_鱗甲_鱗3_表示;
    		竜性_鱗甲_鱗2_表示 = e.竜性_鱗甲_鱗2_表示;
    		竜性_鱗甲_鱗1_表示 = e.竜性_鱗甲_鱗1_表示;
    		薬指_指_表示 = e.薬指_指_表示;
    		薬指_爪_表示 = e.薬指_爪_表示;
    		薬指_竜性_鱗_下_鱗1_表示 = e.薬指_竜性_鱗_下_鱗1_表示;
    		薬指_竜性_鱗_下_鱗2_表示 = e.薬指_竜性_鱗_下_鱗2_表示;
    		薬指_竜性_鱗_上_鱗1_表示 = e.薬指_竜性_鱗_上_鱗1_表示;
    		薬指_竜性_鱗_上_鱗2_表示 = e.薬指_竜性_鱗_上_鱗2_表示;
    		薬指_竜性_鱗_上_鱗3_表示 = e.薬指_竜性_鱗_上_鱗3_表示;
    		中指_指_表示 = e.中指_指_表示;
    		中指_爪_表示 = e.中指_爪_表示;
    		中指_竜性_鱗_下_鱗1_表示 = e.中指_竜性_鱗_下_鱗1_表示;
    		中指_竜性_鱗_下_鱗2_表示 = e.中指_竜性_鱗_下_鱗2_表示;
    		中指_竜性_鱗_上_鱗1_表示 = e.中指_竜性_鱗_上_鱗1_表示;
    		中指_竜性_鱗_上_鱗2_表示 = e.中指_竜性_鱗_上_鱗2_表示;
    		中指_竜性_鱗_上_鱗3_表示 = e.中指_竜性_鱗_上_鱗3_表示;
    		人指_指_表示 = e.人指_指_表示;
    		人指_爪_表示 = e.人指_爪_表示;
    		人指_竜性_鱗_下_鱗1_表示 = e.人指_竜性_鱗_下_鱗1_表示;
    		人指_竜性_鱗_下_鱗2_表示 = e.人指_竜性_鱗_下_鱗2_表示;
    		人指_竜性_鱗_上_鱗1_表示 = e.人指_竜性_鱗_上_鱗1_表示;
    		人指_竜性_鱗_上_鱗2_表示 = e.人指_竜性_鱗_上_鱗2_表示;
    		人指_竜性_鱗_上_鱗3_表示 = e.人指_竜性_鱗_上_鱗3_表示;
    		親指_指_表示 = e.親指_指_表示;
    		親指_爪_表示 = e.親指_爪_表示;
    		親指_竜性_鱗_下_鱗1_表示 = e.親指_竜性_鱗_下_鱗1_表示;
    		親指_竜性_鱗_下_鱗2_表示 = e.親指_竜性_鱗_下_鱗2_表示;
    		親指_竜性_鱗_上_鱗1_表示 = e.親指_竜性_鱗_上_鱗1_表示;
    		親指_竜性_鱗_上_鱗2_表示 = e.親指_竜性_鱗_上_鱗2_表示;
    		親指_竜性_鱗_上_鱗3_表示 = e.親指_竜性_鱗_上_鱗3_表示;
    		筋_表示 = e.筋_表示;
    		脚輪_革_表示 = e.脚輪_革_表示;
    		脚輪_金具1_表示 = e.脚輪_金具1_表示;
    		脚輪_金具2_表示 = e.脚輪_金具2_表示;
    		脚輪_金具3_表示 = e.脚輪_金具3_表示;
    		脚輪_金具左_表示 = e.脚輪_金具左_表示;
    		脚輪_金具右_表示 = e.脚輪_金具右_表示;
    		脚輪表示 = e.脚輪表示;
    		欠損 = e.欠損;
    		筋肉 = e.筋肉;
    		拘束 = e.拘束;
    		if (!e.表示)
    		{
    			表示 = false;
    		}
    		base.配色指定 = 配色指定;
    		配色(体配色);
    		X0Y0_足CP = new ColorP(X0Y0_足, 足CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗足_鱗6CP = new ColorP(X0Y0_竜性_鱗足_鱗6, 竜性_鱗足_鱗6CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗足_鱗5CP = new ColorP(X0Y0_竜性_鱗足_鱗5, 竜性_鱗足_鱗5CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗足_鱗4CP = new ColorP(X0Y0_竜性_鱗足_鱗4, 竜性_鱗足_鱗4CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗足_鱗3CP = new ColorP(X0Y0_竜性_鱗足_鱗3, 竜性_鱗足_鱗3CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗足_鱗2CP = new ColorP(X0Y0_竜性_鱗足_鱗2, 竜性_鱗足_鱗2CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗足_鱗1CP = new ColorP(X0Y0_竜性_鱗足_鱗1, 竜性_鱗足_鱗1CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗踵_鱗1CP = new ColorP(X0Y0_竜性_鱗踵_鱗1, 竜性_鱗踵_鱗1CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗踵_鱗2CP = new ColorP(X0Y0_竜性_鱗踵_鱗2, 竜性_鱗踵_鱗2CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗踵_鱗3CP = new ColorP(X0Y0_竜性_鱗踵_鱗3, 竜性_鱗踵_鱗3CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗11CP = new ColorP(X0Y0_竜性_鱗甲_鱗11, 竜性_鱗甲_鱗11CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗10CP = new ColorP(X0Y0_竜性_鱗甲_鱗10, 竜性_鱗甲_鱗10CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗9CP = new ColorP(X0Y0_竜性_鱗甲_鱗9, 竜性_鱗甲_鱗9CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗8CP = new ColorP(X0Y0_竜性_鱗甲_鱗8, 竜性_鱗甲_鱗8CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗7CP = new ColorP(X0Y0_竜性_鱗甲_鱗7, 竜性_鱗甲_鱗7CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗6CP = new ColorP(X0Y0_竜性_鱗甲_鱗6, 竜性_鱗甲_鱗6CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗5CP = new ColorP(X0Y0_竜性_鱗甲_鱗5, 竜性_鱗甲_鱗5CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗4CP = new ColorP(X0Y0_竜性_鱗甲_鱗4, 竜性_鱗甲_鱗4CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗3CP = new ColorP(X0Y0_竜性_鱗甲_鱗3, 竜性_鱗甲_鱗3CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗2CP = new ColorP(X0Y0_竜性_鱗甲_鱗2, 竜性_鱗甲_鱗2CD, DisUnit, abj: true);
    		X0Y0_竜性_鱗甲_鱗1CP = new ColorP(X0Y0_竜性_鱗甲_鱗1, 竜性_鱗甲_鱗1CD, DisUnit, abj: true);
    		X0Y0_薬指_指CP = new ColorP(X0Y0_薬指_指, 薬指_指CD, DisUnit, abj: true);
    		X0Y0_薬指_爪CP = new ColorP(X0Y0_薬指_爪, 薬指_爪CD, DisUnit, abj: true);
    		X0Y0_薬指_竜性_鱗_下_鱗1CP = new ColorP(X0Y0_薬指_竜性_鱗_下_鱗1, 薬指_竜性_鱗_下_鱗1CD, DisUnit, abj: true);
    		X0Y0_薬指_竜性_鱗_下_鱗2CP = new ColorP(X0Y0_薬指_竜性_鱗_下_鱗2, 薬指_竜性_鱗_下_鱗2CD, DisUnit, abj: true);
    		X0Y0_薬指_竜性_鱗_上_鱗1CP = new ColorP(X0Y0_薬指_竜性_鱗_上_鱗1, 薬指_竜性_鱗_上_鱗1CD, DisUnit, abj: true);
    		X0Y0_薬指_竜性_鱗_上_鱗2CP = new ColorP(X0Y0_薬指_竜性_鱗_上_鱗2, 薬指_竜性_鱗_上_鱗2CD, DisUnit, abj: true);
    		X0Y0_薬指_竜性_鱗_上_鱗3CP = new ColorP(X0Y0_薬指_竜性_鱗_上_鱗3, 薬指_竜性_鱗_上_鱗3CD, DisUnit, abj: true);
    		X0Y0_中指_指CP = new ColorP(X0Y0_中指_指, 中指_指CD, DisUnit, abj: true);
    		X0Y0_中指_爪CP = new ColorP(X0Y0_中指_爪, 中指_爪CD, DisUnit, abj: true);
    		X0Y0_中指_竜性_鱗_下_鱗1CP = new ColorP(X0Y0_中指_竜性_鱗_下_鱗1, 中指_竜性_鱗_下_鱗1CD, DisUnit, abj: true);
    		X0Y0_中指_竜性_鱗_下_鱗2CP = new ColorP(X0Y0_中指_竜性_鱗_下_鱗2, 中指_竜性_鱗_下_鱗2CD, DisUnit, abj: true);
    		X0Y0_中指_竜性_鱗_上_鱗1CP = new ColorP(X0Y0_中指_竜性_鱗_上_鱗1, 中指_竜性_鱗_上_鱗1CD, DisUnit, abj: true);
    		X0Y0_中指_竜性_鱗_上_鱗2CP = new ColorP(X0Y0_中指_竜性_鱗_上_鱗2, 中指_竜性_鱗_上_鱗2CD, DisUnit, abj: true);
    		X0Y0_中指_竜性_鱗_上_鱗3CP = new ColorP(X0Y0_中指_竜性_鱗_上_鱗3, 中指_竜性_鱗_上_鱗3CD, DisUnit, abj: true);
    		X0Y0_人指_指CP = new ColorP(X0Y0_人指_指, 人指_指CD, DisUnit, abj: true);
    		X0Y0_人指_爪CP = new ColorP(X0Y0_人指_爪, 人指_爪CD, DisUnit, abj: true);
    		X0Y0_人指_竜性_鱗_下_鱗1CP = new ColorP(X0Y0_人指_竜性_鱗_下_鱗1, 人指_竜性_鱗_下_鱗1CD, DisUnit, abj: true);
    		X0Y0_人指_竜性_鱗_下_鱗2CP = new ColorP(X0Y0_人指_竜性_鱗_下_鱗2, 人指_竜性_鱗_下_鱗2CD, DisUnit, abj: true);
    		X0Y0_人指_竜性_鱗_上_鱗1CP = new ColorP(X0Y0_人指_竜性_鱗_上_鱗1, 人指_竜性_鱗_上_鱗1CD, DisUnit, abj: true);
    		X0Y0_人指_竜性_鱗_上_鱗2CP = new ColorP(X0Y0_人指_竜性_鱗_上_鱗2, 人指_竜性_鱗_上_鱗2CD, DisUnit, abj: true);
    		X0Y0_人指_竜性_鱗_上_鱗3CP = new ColorP(X0Y0_人指_竜性_鱗_上_鱗3, 人指_竜性_鱗_上_鱗3CD, DisUnit, abj: true);
    		X0Y0_親指_指CP = new ColorP(X0Y0_親指_指, 親指_指CD, DisUnit, abj: true);
    		X0Y0_親指_爪CP = new ColorP(X0Y0_親指_爪, 親指_爪CD, DisUnit, abj: true);
    		X0Y0_親指_竜性_鱗_下_鱗1CP = new ColorP(X0Y0_親指_竜性_鱗_下_鱗1, 親指_竜性_鱗_下_鱗1CD, DisUnit, abj: true);
    		X0Y0_親指_竜性_鱗_下_鱗2CP = new ColorP(X0Y0_親指_竜性_鱗_下_鱗2, 親指_竜性_鱗_下_鱗2CD, DisUnit, abj: true);
    		X0Y0_親指_竜性_鱗_上_鱗1CP = new ColorP(X0Y0_親指_竜性_鱗_上_鱗1, 親指_竜性_鱗_上_鱗1CD, DisUnit, abj: true);
    		X0Y0_親指_竜性_鱗_上_鱗2CP = new ColorP(X0Y0_親指_竜性_鱗_上_鱗2, 親指_竜性_鱗_上_鱗2CD, DisUnit, abj: true);
    		X0Y0_親指_竜性_鱗_上_鱗3CP = new ColorP(X0Y0_親指_竜性_鱗_上_鱗3, 親指_竜性_鱗_上_鱗3CD, DisUnit, abj: true);
    		X0Y0_筋CP = new ColorP(X0Y0_筋, 筋CD, DisUnit, abj: false);
    		X0Y0_脚輪_革CP = new ColorP(X0Y0_脚輪_革, 脚輪_革CD, DisUnit, abj: true);
    		X0Y0_脚輪_金具1CP = new ColorP(X0Y0_脚輪_金具1, 脚輪_金具1CD, DisUnit, abj: true);
    		X0Y0_脚輪_金具2CP = new ColorP(X0Y0_脚輪_金具2, 脚輪_金具2CD, DisUnit, abj: true);
    		X0Y0_脚輪_金具3CP = new ColorP(X0Y0_脚輪_金具3, 脚輪_金具3CD, DisUnit, abj: true);
    		X0Y0_脚輪_金具左CP = new ColorP(X0Y0_脚輪_金具左, 脚輪_金具左CD, DisUnit, abj: true);
    		X0Y0_脚輪_金具右CP = new ColorP(X0Y0_脚輪_金具右, 脚輪_金具右CD, DisUnit, abj: true);
    		Intensity = e.濃度;
    		鎖1 = new 拘束鎖(DisUnit, 右, 配色指定, 体配色, Xasix);
    		鎖1.接続(鎖1_接続点);
    		int num = (右 ? (-10) : 10);
    		鎖1.角度B -= num;
    		鎖表示 = e.鎖表示;
    	}

    	public override void 描画0(RenderArea Are)
    	{
    		Body.Draw(Are);
    		鎖1.描画0(Are);
    	}

    	public override void Dispose()
    	{
    		base.Dispose();
    		鎖1.Dispose();
    	}

    	public override void SetAngle0()
    	{
    		double num = (右 ? (-1.0) : 1.0);
    		X0Y0_足.AngleBase = num * -38.0;
    		X0Y0_薬指_指.AngleBase = num * -6.0;
    		X0Y0_中指_指.AngleBase = num * -6.0;
    		X0Y0_人指_指.AngleBase = num * -6.0;
    		X0Y0_親指_指.AngleBase = num * -6.0;
    		Body.JoinPAall();
    	}

    	public override void 色更新()
    	{
    		X0Y0_足CP.Update();
    		X0Y0_竜性_鱗足_鱗6CP.Update();
    		X0Y0_竜性_鱗足_鱗5CP.Update();
    		X0Y0_竜性_鱗足_鱗4CP.Update();
    		X0Y0_竜性_鱗足_鱗3CP.Update();
    		X0Y0_竜性_鱗足_鱗2CP.Update();
    		X0Y0_竜性_鱗足_鱗1CP.Update();
    		X0Y0_竜性_鱗踵_鱗1CP.Update();
    		X0Y0_竜性_鱗踵_鱗2CP.Update();
    		X0Y0_竜性_鱗踵_鱗3CP.Update();
    		X0Y0_竜性_鱗甲_鱗11CP.Update();
    		X0Y0_竜性_鱗甲_鱗10CP.Update();
    		X0Y0_竜性_鱗甲_鱗9CP.Update();
    		X0Y0_竜性_鱗甲_鱗8CP.Update();
    		X0Y0_竜性_鱗甲_鱗7CP.Update();
    		X0Y0_竜性_鱗甲_鱗6CP.Update();
    		X0Y0_竜性_鱗甲_鱗5CP.Update();
    		X0Y0_竜性_鱗甲_鱗4CP.Update();
    		X0Y0_竜性_鱗甲_鱗3CP.Update();
    		X0Y0_竜性_鱗甲_鱗2CP.Update();
    		X0Y0_竜性_鱗甲_鱗1CP.Update();
    		X0Y0_薬指_指CP.Update();
    		X0Y0_薬指_爪CP.Update();
    		X0Y0_薬指_竜性_鱗_下_鱗1CP.Update();
    		X0Y0_薬指_竜性_鱗_下_鱗2CP.Update();
    		X0Y0_薬指_竜性_鱗_上_鱗1CP.Update();
    		X0Y0_薬指_竜性_鱗_上_鱗2CP.Update();
    		X0Y0_薬指_竜性_鱗_上_鱗3CP.Update();
    		X0Y0_中指_指CP.Update();
    		X0Y0_中指_爪CP.Update();
    		X0Y0_中指_竜性_鱗_下_鱗1CP.Update();
    		X0Y0_中指_竜性_鱗_下_鱗2CP.Update();
    		X0Y0_中指_竜性_鱗_上_鱗1CP.Update();
    		X0Y0_中指_竜性_鱗_上_鱗2CP.Update();
    		X0Y0_中指_竜性_鱗_上_鱗3CP.Update();
    		X0Y0_人指_指CP.Update();
    		X0Y0_人指_爪CP.Update();
    		X0Y0_人指_竜性_鱗_下_鱗1CP.Update();
    		X0Y0_人指_竜性_鱗_下_鱗2CP.Update();
    		X0Y0_人指_竜性_鱗_上_鱗1CP.Update();
    		X0Y0_人指_竜性_鱗_上_鱗2CP.Update();
    		X0Y0_人指_竜性_鱗_上_鱗3CP.Update();
    		X0Y0_親指_指CP.Update();
    		X0Y0_親指_爪CP.Update();
    		X0Y0_親指_竜性_鱗_下_鱗1CP.Update();
    		X0Y0_親指_竜性_鱗_下_鱗2CP.Update();
    		X0Y0_親指_竜性_鱗_上_鱗1CP.Update();
    		X0Y0_親指_竜性_鱗_上_鱗2CP.Update();
    		X0Y0_親指_竜性_鱗_上_鱗3CP.Update();
    		X0Y0_筋CP.Update();
    		X0Y0_脚輪_革CP.Update();
    		X0Y0_脚輪_金具1CP.Update();
    		X0Y0_脚輪_金具2CP.Update();
    		X0Y0_脚輪_金具3CP.Update();
    		X0Y0_脚輪_金具左CP.Update();
    		X0Y0_脚輪_金具右CP.Update();
    		鎖1.接続PA();
    		鎖1.色更新();
    	}

    	private void 配色(BodyColorSet 体配色)
    	{
    		switch (配色指定)
    		{
    		case 配色指定.N0:
    			配色N0(体配色);
    			break;
    		case 配色指定.T0:
    			配色T0(体配色);
    			break;
    		case 配色指定.T1:
    			配色T1(体配色);
    			break;
    		default:
    			配色N0(体配色);
    			break;
    		}
    	}

    	private void 配色N0(BodyColorSet 体配色)
    	{
    		足CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		竜性_鱗足_鱗6CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗5CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗4CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗踵_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗踵_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗踵_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗甲_鱗11CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗10CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗9CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗8CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗7CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗6CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗5CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗4CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		薬指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		薬指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		薬指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		薬指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		薬指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		薬指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		薬指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		中指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		中指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		中指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		中指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		中指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		中指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		中指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		人指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		人指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		人指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		人指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		人指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		人指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		人指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		親指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		親指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		親指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		親指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		親指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		親指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		親指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		筋CD = new ColorD(ref 体配色.薄線, ref 体配色.毛0O);
    		脚輪_革CD = new ColorD();
    		脚輪_金具1CD = new ColorD();
    		脚輪_金具2CD = new ColorD();
    		脚輪_金具3CD = new ColorD();
    		脚輪_金具左CD = new ColorD();
    		脚輪_金具右CD = new ColorD();
    	}

    	private void 配色T0(BodyColorSet 体配色)
    	{
    		足CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		竜性_鱗足_鱗6CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗5CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗4CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗踵_鱗1CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗踵_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗踵_鱗3CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗11CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗10CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗9CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗8CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗7CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗6CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗5CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗4CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗2CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		薬指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		薬指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		薬指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		薬指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		薬指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		薬指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		薬指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		中指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		中指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		中指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		中指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		中指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		中指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		中指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		人指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		人指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		人指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		人指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		人指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		人指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		人指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		親指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		親指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		親指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		親指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		親指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		親指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		親指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		筋CD = new ColorD(ref 体配色.薄線, ref 体配色.毛0O);
    		脚輪_革CD = new ColorD();
    		脚輪_金具1CD = new ColorD();
    		脚輪_金具2CD = new ColorD();
    		脚輪_金具3CD = new ColorD();
    		脚輪_金具左CD = new ColorD();
    		脚輪_金具右CD = new ColorD();
    	}

    	private void 配色T1(BodyColorSet 体配色)
    	{
    		足CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		竜性_鱗足_鱗6CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗5CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗4CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗足_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗踵_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗踵_鱗2CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗踵_鱗3CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		竜性_鱗甲_鱗11CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗10CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗9CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗8CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗7CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗6CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗5CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗4CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗3CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		竜性_鱗甲_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		竜性_鱗甲_鱗1CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		薬指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		薬指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		薬指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		薬指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		薬指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		薬指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		薬指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		中指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		中指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		中指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		中指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		中指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		中指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		中指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		人指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		人指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		人指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		人指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		人指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		人指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		人指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		親指_指CD = new ColorD(ref Col.Black, ref 体配色.毛0O);
    		親指_爪CD = new ColorD(ref Col.Black, ref 体配色.爪O);
    		親指_竜性_鱗_下_鱗1CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		親指_竜性_鱗_下_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗1O);
    		親指_竜性_鱗_上_鱗1CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		親指_竜性_鱗_上_鱗2CD = new ColorD(ref Col.Black, ref 体配色.鱗0O);
    		親指_竜性_鱗_上_鱗3CD = new ColorD(ref Col.Black, ref 体配色.刺青O);
    		筋CD = new ColorD(ref 体配色.薄線, ref 体配色.毛0O);
    		脚輪_革CD = new ColorD();
    		脚輪_金具1CD = new ColorD();
    		脚輪_金具2CD = new ColorD();
    		脚輪_金具3CD = new ColorD();
    		脚輪_金具左CD = new ColorD();
    		脚輪_金具右CD = new ColorD();
    	}

    	public void 脚輪配色(拘束具色 配色)
    	{
    		脚輪_革CD.色 = 配色.革部色;
    		脚輪_金具1CD.色 = 配色.金具色;
    		脚輪_金具2CD.色 = 脚輪_金具1CD.色;
    		脚輪_金具3CD.色 = 脚輪_金具1CD.色;
    		脚輪_金具左CD.色 = 脚輪_金具1CD.色;
    		脚輪_金具右CD.色 = 脚輪_金具1CD.色;
    	}

    	public void 鎖配色(鎖色 配色)
    	{
    		鎖1.配色鎖(配色);
    	}
    }
}
